m-labs/dslite2svd/svd/tm4c123gh6pm.xml
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>TM4C123GH6PM</name>
  <series>Tiva C Series</series>
  <version>1</version>
  <description>(no description)</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <peripherals>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/watchdog.xml -->
    <peripheral>
      <name>WATCHDOG0</name>
      <description>Watchdog Timer register offsets</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>LOAD</name>
          <displayName>WDT_LOAD</displayName>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>VALUE</name>
          <displayName>WDT_VALUE</displayName>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CTL</name>
          <displayName>WDT_CTL</displayName>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTEN</name>
              <description>Watchdog Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESEN</name>
              <description>Watchdog Reset Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>Watchdog Interrupt Type</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRC</name>
              <description>Write Complete</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>WDT_ICR</displayName>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>RIS</name>
          <displayName>WDT_RIS</displayName>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_RIS_WDTRIS</name>
              <description>Watchdog Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>WDT_MIS</displayName>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_MIS_WDTMIS</name>
              <description>Watchdog Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <displayName>WDT_TEST</displayName>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_TEST_STALL</name>
              <description>Watchdog Stall Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <displayName>WDT_LOCK</displayName>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/watchdog.xml -->
    <peripheral derivedFrom="WATCHDOG0">
      <name>WATCHDOG1</name>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral>
      <name>GPIO_PORTA</name>
      <description>GPIO register offsets</description>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <displayName>GPIO_DATA</displayName>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DIR</name>
          <displayName>GPIO_DIR</displayName>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IS</name>
          <displayName>GPIO_IS</displayName>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IBE</name>
          <displayName>GPIO_IBE</displayName>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IEV</name>
          <displayName>GPIO_IEV</displayName>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>IM</name>
          <displayName>GPIO_IM</displayName>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_IM_GPIO</name>
              <description>GPIO Interrupt Mask Enable</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>GPIO_RIS</displayName>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_RIS_GPIO</name>
              <description>GPIO Interrupt Raw Status</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <displayName>GPIO_MIS</displayName>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_MIS_GPIO</name>
              <description>GPIO Masked Interrupt Status</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>GPIO_ICR</displayName>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_ICR_GPIO</name>
              <description>GPIO Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSEL</name>
          <displayName>GPIO_AFSEL</displayName>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR2R</name>
          <displayName>GPIO_DR2R</displayName>
          <description>GPIO 2-mA Drive Select</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR4R</name>
          <displayName>GPIO_DR4R</displayName>
          <description>GPIO 4-mA Drive Select</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DR8R</name>
          <displayName>GPIO_DR8R</displayName>
          <description>GPIO 8-mA Drive Select</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ODR</name>
          <displayName>GPIO_ODR</displayName>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PUR</name>
          <displayName>GPIO_PUR</displayName>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PDR</name>
          <displayName>GPIO_PDR</displayName>
          <description>GPIO Pull-Down Select</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SLR</name>
          <displayName>GPIO_SLR</displayName>
          <description>GPIO Slew Rate Control Select</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DEN</name>
          <displayName>GPIO_DEN</displayName>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>LOCK</name>
          <displayName>GPIO_LOCK</displayName>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CR</name>
          <displayName>GPIO_CR</displayName>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>AMSEL</name>
          <displayName>GPIO_AMSEL</displayName>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>PCTL</name>
          <displayName>GPIO_PCTL</displayName>
          <description>GPIO Port Control</description>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ADCCTL</name>
          <displayName>GPIO_ADCCTL</displayName>
          <description>GPIO ADC Control</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>DMACTL</name>
          <displayName>GPIO_DMACTL</displayName>
          <description>GPIO DMA Control</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
        </register>
