m-labs/dslite2svd/svd/tm4c123gh6pm.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI1</name>
      <baseAddress>0x40009000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI2</name>
      <baseAddress>0x4000A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/ssi.xml -->
    <peripheral derivedFrom="SSI0">
      <name>SSI3</name>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/uart.xml -->
    <peripheral>
      <name>UART0</name>
      <description>UART register offsets</description>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <displayName>UART_DR</displayName>
          <description>UART Data</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Transmitted or Received</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>UART Framing Error</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PE</name>
              <description>UART Parity Error</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BE</name>
              <description>UART Break Error</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OE</name>
              <description>UART Overrun Error</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <displayName>UART_RSR</displayName>
          <description>UART Receive Status/Error Clear</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FE</name>
              <description>UART Framing Error</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PE</name>
              <description>UART Parity Error</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BE</name>
              <description>UART Break Error</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OE</name>
              <description>UART Overrun Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <displayName>UART_ECR</displayName>
          <description>UART Receive Status/Error Clear</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_ECR_DATA</name>
              <description>Error Clear</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>UART_FR</displayName>
          <description>UART Flag</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTS</name>
              <description>Clear To Send</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>UART Busy</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFE</name>
              <description>UART Receive FIFO Empty</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFF</name>
              <description>UART Transmit FIFO Full</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFF</name>
              <description>UART Receive FIFO Full</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>UART Transmit FIFO Empty</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ILPR</name>
          <displayName>UART_ILPR</displayName>
          <description>UART IrDA Low-Power Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_ILPR_ILPDVSR</name>
              <description>IrDA Low-Power Divisor</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBRD</name>
          <displayName>UART_IBRD</displayName>
          <description>UART Integer Baud-Rate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_IBRD_DIVINT</name>
              <description>Integer Baud-Rate Divisor</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBRD</name>
          <displayName>UART_FBRD</displayName>
          <description>UART Fractional Baud-Rate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART_FBRD_DIVFRAC</name>
              <description>Fractional Baud-Rate Divisor</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCRH</name>
          <displayName>UART_LCRH</displayName>
          <description>UART Line Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>UART Send Break</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>UART Parity Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPS</name>
              <description>UART Even Parity Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STP2</name>
              <description>UART Two Stop Bits Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FEN</name>
              <description>UART Enable FIFOs</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WLEN</name>
              <description>UART Word Length</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_5</name>
                  <description>5 bits (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>6 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>7 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8</name>
                  <description>8 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPS</name>
              <description>UART Stick Parity Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <displayName>UART_CTL</displayName>
          <description>UART Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UARTEN</name>
              <description>UART Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SIREN</name>
              <description>UART SIR Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SIRLP</name>
              <description>UART SIR Low-Power Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SMART</name>
              <description>ISO 7816 Smart Card Support</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EOT</name>
              <description>End of Transmission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSE</name>
              <description>High-Speed Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LBE</name>
              <description>UART Loop Back Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>UART Transmit Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXE</name>
              <description>UART Receive Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS</name>
              <description>Request to Send</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTSEN</name>
              <description>Enable Request to Send</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSEN</name>
              <description>Enable Clear To Send</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFLS</name>
          <displayName>UART_IFLS</displayName>
          <description>UART Interrupt FIFO Level Select</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX</name>
              <description>UART Transmit Interrupt FIFO Level Select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX1_8</name>
                  <description>TX FIFO &amp;lt;= 1/8 full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2_8</name>
                  <description>TX FIFO &amp;lt;= 1/4 full</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX4_8</name>
                  <description>TX FIFO &amp;lt;= 1/2 full (default)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX6_8</name>
                  <description>TX FIFO &amp;lt;= 3/4 full</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX7_8</name>
                  <description>TX FIFO &amp;lt;= 7/8 full</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>UART Receive Interrupt FIFO Level Select</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX1_8</name>
                  <description>RX FIFO &gt;= 1/8 full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2_8</name>
                  <description>RX FIFO &gt;= 1/4 full</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX4_8</name>
                  <description>RX FIFO &gt;= 1/2 full (default)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX6_8</name>
                  <description>RX FIFO &gt;= 3/4 full</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX7_8</name>
                  <description>RX FIFO &gt;= 7/8 full</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>UART_IM</displayName>
          <description>UART Interrupt Mask</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSMIM</name>
              <description>UART Clear to Send Modem Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIM</name>
              <description>UART Receive Interrupt Mask</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXIM</name>
              <description>UART Transmit Interrupt Mask</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTIM</name>
              <description>UART Receive Time-Out Interrupt Mask</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FEIM</name>
              <description>UART Framing Error Interrupt Mask</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PEIM</name>
              <description>UART Parity Error Interrupt Mask</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BEIM</name>
              <description>UART Break Error Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>OEIM</name>
              <description>UART Overrun Error Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>_9BITIM</name>
              <description>9-Bit Mode Interrupt Mask</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>UART_RIS</displayName>
          <description>UART Raw Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CTSRIS</name>
              <description>UART Clear to Send Modem Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRIS</name>
              <description>UART Receive Raw Interrupt Status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRIS</name>
              <description>UART Transmit Raw Interrupt Status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTRIS</name>
              <description>UART Receive Time-Out Raw Interrupt Status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FERIS</name>
              <description>UART Framing Error Raw Interrupt Status</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PERIS</name>
              <description>UART Parity Error Raw Interrupt Status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BERIS</name>
              <description>UART Break Error Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OERIS</name>
              <description>UART Overrun Error Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>_9BITRIS</name>
              <description>9-Bit Mode Raw Interrupt Status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
