m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>SACKCTL</name>
          <displayName>I2C_SACKCTL</displayName>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>I2C_PP</displayName>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_PP_HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>I2C_PC</displayName>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_PC_HS</name>
              <description>High-Speed Capable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C2</name>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/i2c.xml -->
    <peripheral derivedFrom="I2C0">
      <name>I2C3</name>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTE</name>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/gpio.xml -->
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTF</name>
      <baseAddress>0x40025000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/pwm.xml -->
    <peripheral>
      <name>PWM0</name>
      <description>PWM register offsets</description>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>PWM_CTL</displayName>
          <description>PWM Master Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GLOBALSYNC0</name>
              <description>Update PWM Generator 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBALSYNC1</name>
              <description>Update PWM Generator 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBALSYNC2</name>
              <description>Update PWM Generator 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBALSYNC3</name>
              <description>Update PWM Generator 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <displayName>PWM_SYNC</displayName>
          <description>PWM Time Base Sync</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC0</name>
              <description>Reset Generator 0 Counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1</name>
              <description>Reset Generator 1 Counter</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC2</name>
              <description>Reset Generator 2 Counter</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC3</name>
              <description>Reset Generator 3 Counter</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <displayName>PWM_ENABLE</displayName>
          <description>PWM Output Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0EN</name>
              <description>MnPWM0 Output Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1EN</name>
              <description>MnPWM1 Output Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2EN</name>
              <description>MnPWM2 Output Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3EN</name>
              <description>MnPWM3 Output Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM4EN</name>
              <description>MnPWM4 Output Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM5EN</name>
              <description>MnPWM5 Output Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM6EN</name>
              <description>MnPWM6 Output Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM7EN</name>
              <description>MnPWM7 Output Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INVERT</name>
          <displayName>PWM_INVERT</displayName>
          <description>PWM Output Inversion</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0INV</name>
              <description>Invert MnPWM0 Signal</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1INV</name>
              <description>Invert MnPWM1 Signal</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2INV</name>
              <description>Invert MnPWM2 Signal</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3INV</name>
              <description>Invert MnPWM3 Signal</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM4INV</name>
              <description>Invert MnPWM4 Signal</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM5INV</name>
              <description>Invert MnPWM5 Signal</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM6INV</name>
              <description>Invert MnPWM6 Signal</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM7INV</name>
              <description>Invert MnPWM7 Signal</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT</name>
          <displayName>PWM_FAULT</displayName>
          <description>PWM Output Fault</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>MnPWM0 Fault</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>MnPWM1 Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2</name>
              <description>MnPWM2 Fault</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT3</name>
              <description>MnPWM3 Fault</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT4</name>
              <description>MnPWM4 Fault</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT5</name>
              <description>MnPWM5 Fault</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT6</name>
              <description>MnPWM6 Fault</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT7</name>
              <description>MnPWM7 Fault</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <displayName>PWM_INTEN</displayName>
          <description>PWM Interrupt Enable</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPWM0</name>
              <description>PWM0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM1</name>
              <description>PWM1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM2</name>
              <description>PWM2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM3</name>
              <description>PWM3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFAULT0</name>
              <description>Interrupt Fault 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFAULT1</name>
              <description>Interrupt Fault 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <displayName>PWM_RIS</displayName>
          <description>PWM Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPWM0</name>
              <description>PWM0 Interrupt Asserted</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTPWM1</name>
              <description>PWM1 Interrupt Asserted</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTPWM2</name>
              <description>PWM2 Interrupt Asserted</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTPWM3</name>
              <description>PWM3 Interrupt Asserted</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTFAULT0</name>
              <description>Interrupt Fault PWM 0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTFAULT1</name>
              <description>Interrupt Fault PWM 1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <displayName>PWM_ISC</displayName>
          <description>PWM Interrupt Status and Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTPWM0</name>
              <description>PWM0 Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM1</name>
              <description>PWM1 Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM2</name>
              <description>PWM2 Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTPWM3</name>
              <description>PWM3 Interrupt Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFAULT0</name>
              <description>FAULT0 Interrupt Asserted</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTFAULT1</name>
              <description>FAULT1 Interrupt Asserted</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>PWM_STATUS</displayName>
          <description>PWM Status</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Generator 0 Fault Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Generator 1 Fault Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTVAL</name>
          <displayName>PWM_FAULTVAL</displayName>
          <description>PWM Fault Condition Value</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0</name>
              <description>MnPWM0 Fault Value</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1</name>
              <description>MnPWM1 Fault Value</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2</name>
              <description>MnPWM2 Fault Value</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3</name>
              <description>MnPWM3 Fault Value</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM4</name>
              <description>MnPWM4 Fault Value</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM5</name>
              <description>MnPWM5 Fault Value</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM6</name>
              <description>MnPWM6 Fault Value</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM7</name>
              <description>MnPWM7 Fault Value</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
