m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>_1_FLTSTAT0</name>
          <displayName>PWM_1_FLTSTAT0</displayName>
          <description>PWM1 Fault Status 0</description>
          <addressOffset>0x00000884</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSTAT1</name>
          <displayName>PWM_1_FLTSTAT1</displayName>
          <description>PWM1 Fault Status 1</description>
          <addressOffset>0x00000888</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSTAT0</name>
          <displayName>PWM_2_FLTSTAT0</displayName>
          <description>PWM2 Fault Status 0</description>
          <addressOffset>0x00000904</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_2_FLTSTAT1</name>
          <displayName>PWM_2_FLTSTAT1</displayName>
          <description>PWM2 Fault Status 1</description>
          <addressOffset>0x00000908</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSTAT0</name>
          <displayName>PWM_3_FLTSTAT0</displayName>
          <description>PWM3 Fault Status 0</description>
          <addressOffset>0x00000984</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAULT0</name>
              <description>Fault Input 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Fault Input 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSTAT1</name>
          <displayName>PWM_3_FLTSTAT1</displayName>
          <description>PWM3 Fault Status 1</description>
          <addressOffset>0x00000988</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>PWM_PP</displayName>
          <description>PWM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GCNT</name>
              <description>Generators</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>FCNT</name>
              <description>Fault Inputs (per PWM unit)</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ESYNC</name>
              <description>Extended Synchronization</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EFAULT</name>
              <description>Extended Fault</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ONE</name>
              <description>One-Shot Mode</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
