m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>MIS</name>
          <displayName>TIMER_MIS</displayName>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAMMIS</name>
              <description>GPTM Timer A Capture Mode Match Masked Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAEMIS</name>
              <description>GPTM Timer A Capture Mode Event Masked Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCMIS</name>
              <description>GPTM RTC Masked Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TAMMIS</name>
              <description>GPTM Timer A Match Masked Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CBMMIS</name>
              <description>GPTM Timer B Capture Mode Match Masked Interrupt</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CBEMIS</name>
              <description>GPTM Timer B Capture Mode Event Masked Interrupt</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TBMMIS</name>
              <description>GPTM Timer B Match Masked Interrupt</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WUEMIS</name>
              <description>32/64-Bit Wide GPTM Write Update Error Masked Interrupt Status</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>TIMER_ICR</displayName>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>CAMCINT</name>
              <description>GPTM Timer A Capture Mode Match Interrupt Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>CAECINT</name>
              <description>GPTM Timer A Capture Mode Event Interrupt Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>RTCCINT</name>
              <description>GPTM RTC Interrupt Clear</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TAMCINT</name>
              <description>GPTM Timer A Match Interrupt Clear</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>CBMCINT</name>
              <description>GPTM Timer B Capture Mode Match Interrupt Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>CBECINT</name>
              <description>GPTM Timer B Capture Mode Event Interrupt Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>TBMCINT</name>
              <description>GPTM Timer B Match Interrupt Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>WUECINT</name>
              <description>32/64-Bit Wide GPTM Write Update Error Interrupt Clear</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAILR</name>
          <displayName>TIMER_TAILR</displayName>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TBILR</name>
          <displayName>TIMER_TBILR</displayName>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TAMATCHR</name>
          <displayName>TIMER_TAMATCHR</displayName>
          <description>GPTM Timer A Match</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TBMATCHR</name>
          <displayName>TIMER_TBMATCHR</displayName>
          <description>GPTM Timer B Match</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TAPR</name>
          <displayName>TIMER_TAPR</displayName>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAPSRH</name>
              <description>GPTM Timer A Prescale High Byte</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <displayName>TIMER_TBPR</displayName>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPSRH</name>
              <description>GPTM Timer B Prescale High Byte</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPMR</name>
          <displayName>TIMER_TAPMR</displayName>
          <description>GPTM TimerA Prescale Match</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAPSMR</name>
              <description>GPTM TimerA Prescale Match</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TAPSMRH</name>
              <description>GPTM Timer A Prescale Match High Byte</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPMR</name>
          <displayName>TIMER_TBPMR</displayName>
          <description>GPTM TimerB Prescale Match</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TBPSMR</name>
              <description>GPTM TimerB Prescale Match</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBPSMRH</name>
              <description>GPTM Timer B Prescale Match High Byte</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <displayName>TIMER_TAR</displayName>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>TBR</name>
          <displayName>TIMER_TBR</displayName>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>TAV</name>
          <displayName>TIMER_TAV</displayName>
          <description>GPTM Timer A Value</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TBV</name>
          <displayName>TIMER_TBV</displayName>
          <description>GPTM Timer B Value</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RTCPD</name>
          <displayName>TIMER_RTCPD</displayName>
          <description>GPTM RTC Predivide</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_RTCPD_RTCPD</name>
              <description>RTC Predivide Counter Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPS</name>
          <displayName>TIMER_TAPS</displayName>
          <description>GPTM Timer A Prescale Snapshot</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAPS_PSS</name>
              <description>GPTM Timer A Prescaler Snapshot</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPS</name>
          <displayName>TIMER_TBPS</displayName>
          <description>GPTM Timer B Prescale Snapshot</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBPS_PSS</name>
              <description>GPTM Timer A Prescaler Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPV</name>
          <displayName>TIMER_TAPV</displayName>
          <description>GPTM Timer A Prescale Value</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TAPV_PSV</name>
              <description>GPTM Timer A Prescaler Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPV</name>
          <displayName>TIMER_TBPV</displayName>
          <description>GPTM Timer B Prescale Value</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_TBPV_PSV</name>
              <description>GPTM Timer B Prescaler Value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>TIMER_PP</displayName>
          <description>GPTM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_PP_SIZE</name>
              <description>Count Size</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_16</name>
                  <description>Timer A and Timer B counters are 16 bits each with an 8-bit prescale counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>Timer A and Timer B counters are 32 bits each with a 16-bit prescale counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
