m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>DCCTL7</name>
          <displayName>ADC_DCCTL7</displayName>
          <description>ADC Digital Comparator Control 7</description>
          <addressOffset>0x00000E1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CIM</name>
              <description>Comparison Interrupt Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC</name>
              <description>Comparison Interrupt Condition</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIE</name>
              <description>Comparison Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTM</name>
              <description>Comparison Trigger Mode</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTC</name>
              <description>Comparison Trigger Condition</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTE</name>
              <description>Comparison Trigger Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP0</name>
          <displayName>ADC_DCCMP0</displayName>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP1</name>
          <displayName>ADC_DCCMP1</displayName>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <displayName>ADC_DCCMP2</displayName>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <displayName>ADC_DCCMP3</displayName>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <displayName>ADC_DCCMP4</displayName>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <displayName>ADC_DCCMP5</displayName>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <displayName>ADC_DCCMP6</displayName>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <displayName>ADC_DCCMP7</displayName>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMP0</name>
              <description>Compare 0</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Compare 1</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>ADC_PP</displayName>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSR</name>
              <description>Maximum ADC Sample Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH</name>
              <description>ADC Channel Count</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DC</name>
              <description>Digital Comparator Count</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>ADC Architecture</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_TYPE_SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSL</name>
              <description>Resolution</description>
              <lsb>18</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TS</name>
              <description>Temperature Sensor</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <displayName>ADC_PC</displayName>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_PC_SR</name>
              <description>ADC Sample Rate</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <displayName>ADC_CC</displayName>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC_CC_CS</name>
              <description>ADC Clock Source</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSPLL</name>
                  <description>PLL VCO divided by CLKDIV</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
