m-labs/dslite2svd/svd/tm4c123gh6pm.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/can.xml -->
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER2</name>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER3</name>
      <baseAddress>0x4004D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER4</name>
      <baseAddress>0x4004E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4cc231e6pm/wtimer.xml -->
    <peripheral derivedFrom="WTIMER0">
      <name>WTIMER5</name>
      <baseAddress>0x4004F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/usb.xml -->
    <peripheral>
      <name>USB0</name>
      <description>Univeral Serial Bus register offsets</description>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>FADDR</name>
          <displayName>USB_FADDR</displayName>
          <description>USB Device Functional Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FADDR</name>
              <description>Function Address</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <displayName>USB_POWER</displayName>
          <description>USB Power</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PWRDNPHY</name>
              <description>Power Down PHY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>SUSPEND Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>RESUME Signaling</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET Signaling</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTCONN</name>
              <description>Soft Connect/Disconnect</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ISOUP</name>
              <description>Isochronous Update</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIS</name>
          <displayName>USB_TXIS</displayName>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP0</name>
              <description>TX and RX Endpoint 0 Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP1</name>
              <description>TX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP2</name>
              <description>TX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP3</name>
              <description>TX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP4</name>
              <description>TX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP5</name>
              <description>TX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP6</name>
              <description>TX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP7</name>
              <description>TX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIS</name>
          <displayName>USB_RXIS</displayName>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>RX Endpoint 1 Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP2</name>
              <description>RX Endpoint 2 Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP3</name>
              <description>RX Endpoint 3 Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP4</name>
              <description>RX Endpoint 4 Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP5</name>
              <description>RX Endpoint 5 Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP6</name>
              <description>RX Endpoint 6 Interrupt</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EP7</name>
              <description>RX Endpoint 7 Interrupt</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIE</name>
          <displayName>USB_TXIE</displayName>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP0</name>
              <description>TX and RX Endpoint 0 Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP1</name>
              <description>TX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP2</name>
              <description>TX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP3</name>
              <description>TX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP4</name>
              <description>TX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP5</name>
              <description>TX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP6</name>
              <description>TX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP7</name>
              <description>TX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIE</name>
          <displayName>USB_RXIE</displayName>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>RX Endpoint 1 Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP2</name>
              <description>RX Endpoint 2 Interrupt Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP3</name>
              <description>RX Endpoint 3 Interrupt Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP4</name>
              <description>RX Endpoint 4 Interrupt Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP5</name>
              <description>RX Endpoint 5 Interrupt Enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP6</name>
              <description>RX Endpoint 6 Interrupt Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP7</name>
              <description>RX Endpoint 7 Interrupt Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <displayName>USB_IS</displayName>
          <description>USB General Interrupt Status</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>SUSPEND Signaling Detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>RESUME Signaling Detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BABBLE</name>
              <description>Babble Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET Signaling Detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF</name>
              <description>Start of Frame</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CONN</name>
              <description>Session Connect</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DISCON</name>
              <description>Session Disconnect (OTG only)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SESREQ</name>
              <description>SESSION REQUEST (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUSERR</name>
              <description>VBUS Error (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <displayName>USB_IE</displayName>
          <description>USB Interrupt Enable</description>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SUSPND</name>
              <description>Enable SUSPEND Interrupt</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME</name>
              <description>Enable RESUME Interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BABBLE</name>
              <description>Enable Babble Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Enable RESET Interrupt</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF</name>
              <description>Enable Start-of-Frame Interrupt</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CONN</name>
              <description>Enable Connect Interrupt</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCON</name>
              <description>Enable Disconnect Interrupt</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SESREQ</name>
              <description>Enable Session Request (OTG only)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSERR</name>
              <description>Enable VBUS Error Interrupt (OTG only)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <displayName>USB_FRAME</displayName>
          <description>USB Frame Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_FRAME</name>
              <description>Frame Number</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDX</name>
          <displayName>USB_EPIDX</displayName>
          <description>USB Endpoint Index</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_EPIDX_EPIDX</name>
              <description>Endpoint Index</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <displayName>USB_TEST</displayName>
          <description>USB Test Mode</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FORCEFS</name>
              <description>Force Full-Speed Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOACC</name>
              <description>FIFO Access</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEH</name>
              <description>Force Host Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <displayName>USB_FIFO0</displayName>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO1</name>
          <displayName>USB_FIFO1</displayName>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO2</name>
          <displayName>USB_FIFO2</displayName>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO3</name>
          <displayName>USB_FIFO3</displayName>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO4</name>
          <displayName>USB_FIFO4</displayName>
          <description>USB FIFO Endpoint 4</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO5</name>
          <displayName>USB_FIFO5</displayName>
          <description>USB FIFO Endpoint 5</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO6</name>
          <displayName>USB_FIFO6</displayName>
          <description>USB FIFO Endpoint 6</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FIFO7</name>
          <displayName>USB_FIFO7</displayName>
          <description>USB FIFO Endpoint 7</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
