m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>RQPKTCOUNT4</name>
          <displayName>USB_RQPKTCOUNT4</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT5</name>
          <displayName>USB_RQPKTCOUNT5</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT6</name>
          <displayName>USB_RQPKTCOUNT6</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RQPKTCOUNT7</name>
          <displayName>USB_RQPKTCOUNT7</displayName>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <displayName>USB_RXDPKTBUFDIS</displayName>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <displayName>USB_TXDPKTBUFDIS</displayName>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPC</name>
          <displayName>USB_EPC</displayName>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBLOW</name>
                  <description>Power Enable High if VBUS Low (OTG only)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBHIGH</name>
                  <description>Power Enable High if VBUS High (OTG only)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENDE</name>
              <description>EPEN Drive Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PFLTACT</name>
              <description>Power Fault Action</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIS</name>
                  <description>Tristate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCRIS</name>
          <displayName>USB_EPCRIS</displayName>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCRIS_PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCIM</name>
          <displayName>USB_EPCIM</displayName>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCIM_PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCISC</name>
          <displayName>USB_EPCISC</displayName>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_EPCISC_PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <displayName>USB_DRRIS</displayName>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIM</name>
          <displayName>USB_DRIM</displayName>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRIM_RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRISC</name>
          <displayName>USB_DRISC</displayName>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DRISC_RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCS</name>
          <displayName>USB_GPCS</displayName>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEVMOD</name>
              <description>Device Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVMODOTG</name>
              <description>Enable Device Mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDC</name>
          <displayName>USB_VDC</displayName>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDC_VBDEN</name>
              <description>VBUS Droop Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCRIS</name>
          <displayName>USB_VDCRIS</displayName>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCRIS_VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCIM</name>
          <displayName>USB_VDCIM</displayName>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCIM_VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCISC</name>
          <displayName>USB_VDCISC</displayName>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_VDCISC_VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVRIS</name>
          <displayName>USB_IDVRIS</displayName>
          <description>USB ID Valid Detect Raw Interrupt Status</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_IDVRIS_ID</name>
              <description>ID Valid Detect Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVIM</name>
          <displayName>USB_IDVIM</displayName>
          <description>USB ID Valid Detect Interrupt Mask</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_IDVIM_ID</name>
              <description>ID Valid Detect Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVISC</name>
          <displayName>USB_IDVISC</displayName>
          <description>USB ID Valid Detect Interrupt Status and Clear</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_IDVISC_ID</name>
              <description>ID Valid Detect Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASEL</name>
          <displayName>USB_DMASEL</displayName>
          <description>USB DMA Select</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAARX</name>
              <description>DMA A RX Select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAATX</name>
              <description>DMA A TX Select</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABRX</name>
              <description>DMA B RX Select</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABTX</name>
              <description>DMA B TX Select</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACRX</name>
              <description>DMA C RX Select</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACTX</name>
              <description>DMA C TX Select</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <displayName>USB_PP</displayName>
          <description>USB Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Controller Type</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_PP_TYPE_0</name>
                  <description>The first-generation USB controller</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY</name>
              <description>PHY Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB</name>
              <description>USB Capability</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEVICE</name>
                  <description>DEVICE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTDEVICE</name>
                  <description>HOST</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTG</name>
                  <description>OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECNT</name>
              <description>Endpoint Count</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
