m-labs/dslite2svd/svd/tm4c123gh6pm.xml
      </registers>
    </peripheral>
    <!-- ../Modules/Tiva_TM4C/sc4ce93xh6pm/flash.xml -->
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>FLASH register offsets</description>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
        <protection>p</protection>
      </addressBlock>
      <registers>
        <register>
          <name>FMA</name>
          <displayName>FLASH_FMA</displayName>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FMA_OFFSET</name>
              <description>Address Offset</description>
              <lsb>0</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMD</name>
          <displayName>FLASH_FMD</displayName>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FMC</name>
          <displayName>FLASH_FMC</displayName>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMT</name>
              <description>Commit Register Value</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WRKEY</name>
              <description>FLASH write key</description>
              <lsb>17</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCRIS</name>
          <displayName>FLASH_FCRIS</displayName>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERIS</name>
              <description>EEPROM Raw Interrupt Status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VOLTRIS</name>
              <description>Pump Voltage Raw Interrupt Status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>INVDRIS</name>
              <description>Invalid Data Raw Interrupt Status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIS</name>
              <description>Erase Verify Error Raw Interrupt Status</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROGRIS</name>
              <description>Program Verify Error Raw Interrupt Status</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCIM</name>
          <displayName>FLASH_FCIM</displayName>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AMASK</name>
              <description>Access Interrupt Mask</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PMASK</name>
              <description>Programming Interrupt Mask</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMASK</name>
              <description>EEPROM Interrupt Mask</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTMASK</name>
              <description>VOLT Interrupt Mask</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INVDMASK</name>
              <description>Invalid Data Interrupt Mask</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERMASK</name>
              <description>ERVER Interrupt Mask</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROGMASK</name>
              <description>PROGVER Interrupt Mask</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMISC</name>
          <displayName>FLASH_FCMISC</displayName>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>EMISC</name>
              <description>EEPROM Masked Interrupt Status and Clear</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTMISC</name>
              <description>VOLT Masked Interrupt Status and Clear</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INVDMISC</name>
              <description>Invalid Data Masked Interrupt Status and Clear</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERMISC</name>
              <description>ERVER Masked Interrupt Status and Clear</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PROGMISC</name>
              <description>PROGVER Masked Interrupt Status and Clear</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC2</name>
          <displayName>FLASH_FMC2</displayName>
          <description>Flash Memory Control 2</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FMC2_WRBUF</name>
              <description>Buffered Flash Memory Write</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWBVAL</name>
          <displayName>FLASH_FWBVAL</displayName>
          <description>Flash Write Buffer Valid</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FWBN</name>
          <displayName>FLASH_FWBN</displayName>
          <description>Flash Write Buffer n</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FSIZE</name>
          <displayName>FLASH_FSIZE</displayName>
          <description>Flash Size</description>
          <addressOffset>0x00000FC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_FSIZE_SIZE</name>
              <description>Flash Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_FSIZE_SIZE_256KB</name>
                  <description>256 KB of Flash</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIZE</name>
          <displayName>FLASH_SSIZE</displayName>
          <description>SRAM Size</description>
          <addressOffset>0x00000FC4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_SSIZE_SIZE</name>
              <description>SRAM Size</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SSIZE_SIZE_32KB</name>
                  <description>32 KB of SRAM</description>
                  <value>0x7f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMSWMAP</name>
          <displayName>FLASH_ROMSWMAP</displayName>
          <description>ROM Software Map</description>
          <addressOffset>0x00000FCC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_ROMSWMAP_SAFERTOS</name>
              <description>SafeRTOS Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMCTL</name>
          <displayName>FLASH_RMCTL</displayName>
          <description>ROM Control</description>
          <addressOffset>0x000010F0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FLASH_RMCTL_BA</name>
              <description>Boot Alias</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTCFG</name>
          <displayName>FLASH_BOOTCFG</displayName>
          <description>Boot Configuration</description>
          <addressOffset>0x000011D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG0</name>
              <description>Debug Control 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG1</name>
              <description>Debug Control 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EN</name>
              <description>Boot GPIO Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>POL</name>
              <description>Boot GPIO Polarity</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN</name>
              <description>Boot GPIO Pin</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_0</name>
                  <description>Pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1</name>
                  <description>Pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2</name>
                  <description>Pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3</name>
                  <description>Pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4</name>
                  <description>Pin 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5</name>
                  <description>Pin 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6</name>
                  <description>Pin 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_7</name>
                  <description>Pin 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT</name>
              <description>Boot GPIO Port</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A</name>
                  <description>Port A</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Port B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Port C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Port D</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E</name>
                  <description>Port E</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F</name>
                  <description>Port F</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G</name>
                  <description>Port G</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H</name>
                  <description>Port H</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NW</name>
              <description>Not Written</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG0</name>
          <displayName>FLASH_USERREG0</displayName>
          <description>User Register 0</description>
          <addressOffset>0x000011E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USERREG1</name>
          <displayName>FLASH_USERREG1</displayName>
          <description>User Register 1</description>
          <addressOffset>0x000011E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USERREG2</name>
          <displayName>FLASH_USERREG2</displayName>
          <description>User Register 2</description>
          <addressOffset>0x000011E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>USERREG3</name>
          <displayName>FLASH_USERREG3</displayName>
          <description>User Register 3</description>
          <addressOffset>0x000011EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>FMPRE0</name>
          <displayName>FLASH_FMPRE0</displayName>
          <description>Flash Memory Protection Read Enable 0</description>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE1</name>
          <displayName>FLASH_FMPRE1</displayName>
          <description>Flash Memory Protection Read Enable 1</description>
          <addressOffset>0x00001204</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE2</name>
          <displayName>FLASH_FMPRE2</displayName>
          <description>Flash Memory Protection Read Enable 2</description>
          <addressOffset>0x00001208</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPRE3</name>
          <displayName>FLASH_FMPRE3</displayName>
          <description>Flash Memory Protection Read Enable 3</description>
          <addressOffset>0x0000120C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE0</name>
          <displayName>FLASH_FMPPE0</displayName>
          <description>Flash Memory Protection Program Enable 0</description>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE1</name>
          <displayName>FLASH_FMPPE1</displayName>
          <description>Flash Memory Protection Program Enable 1</description>
          <addressOffset>0x00001404</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE2</name>
          <displayName>FLASH_FMPPE2</displayName>
          <description>Flash Memory Protection Program Enable 2</description>
          <addressOffset>0x00001408</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FMPPE3</name>
          <displayName>FLASH_FMPPE3</displayName>
          <description>Flash Memory Protection Program Enable 3</description>
          <addressOffset>0x0000140C</addressOffset>
          <size>32</size>
        </register>
