m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>DC7</name>
          <displayName>SYSCTL_DC7</displayName>
          <description>Device Capabilities 7</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMACH0</name>
              <description>DMA Channel 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH1</name>
              <description>DMA Channel 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH2</name>
              <description>DMA Channel 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH3</name>
              <description>DMA Channel 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH4</name>
              <description>DMA Channel 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH5</name>
              <description>DMA Channel 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH6</name>
              <description>DMA Channel 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH7</name>
              <description>DMA Channel 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH8</name>
              <description>DMA Channel 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH9</name>
              <description>DMA Channel 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH10</name>
              <description>DMA Channel 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH11</name>
              <description>DMA Channel 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH12</name>
              <description>DMA Channel 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH13</name>
              <description>DMA Channel 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH14</name>
              <description>DMA Channel 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH15</name>
              <description>DMA Channel 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH16</name>
              <description>DMA Channel 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH17</name>
              <description>DMA Channel 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH18</name>
              <description>DMA Channel 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH19</name>
              <description>DMA Channel 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH20</name>
              <description>DMA Channel 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH21</name>
              <description>DMA Channel 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH22</name>
              <description>DMA Channel 22</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH23</name>
              <description>DMA Channel 23</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH24</name>
              <description>DMA Channel 24</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH25</name>
              <description>DMA Channel 25</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH26</name>
              <description>DMA Channel 26</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH27</name>
              <description>DMA Channel 27</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH28</name>
              <description>DMA Channel 28</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH29</name>
              <description>DMA Channel 29</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMACH30</name>
              <description>DMA Channel 30</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC8</name>
          <displayName>SYSCTL_DC8</displayName>
          <description>Device Capabilities 8</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC0AIN0</name>
              <description>ADC Module 0 AIN0 Pin Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN1</name>
              <description>ADC Module 0 AIN1 Pin Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN2</name>
              <description>ADC Module 0 AIN2 Pin Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN3</name>
              <description>ADC Module 0 AIN3 Pin Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN4</name>
              <description>ADC Module 0 AIN4 Pin Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN5</name>
              <description>ADC Module 0 AIN5 Pin Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN6</name>
              <description>ADC Module 0 AIN6 Pin Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN7</name>
              <description>ADC Module 0 AIN7 Pin Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN8</name>
              <description>ADC Module 0 AIN8 Pin Present</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN9</name>
              <description>ADC Module 0 AIN9 Pin Present</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN10</name>
              <description>ADC Module 0 AIN10 Pin Present</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN11</name>
              <description>ADC Module 0 AIN11 Pin Present</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN12</name>
              <description>ADC Module 0 AIN12 Pin Present</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN13</name>
              <description>ADC Module 0 AIN13 Pin Present</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN14</name>
              <description>ADC Module 0 AIN14 Pin Present</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0AIN15</name>
              <description>ADC Module 0 AIN15 Pin Present</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN0</name>
              <description>ADC Module 1 AIN0 Pin Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN1</name>
              <description>ADC Module 1 AIN1 Pin Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN2</name>
              <description>ADC Module 1 AIN2 Pin Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN3</name>
              <description>ADC Module 1 AIN3 Pin Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN4</name>
              <description>ADC Module 1 AIN4 Pin Present</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN5</name>
              <description>ADC Module 1 AIN5 Pin Present</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN6</name>
              <description>ADC Module 1 AIN6 Pin Present</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN7</name>
              <description>ADC Module 1 AIN7 Pin Present</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN8</name>
              <description>ADC Module 1 AIN8 Pin Present</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN9</name>
              <description>ADC Module 1 AIN9 Pin Present</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN10</name>
              <description>ADC Module 1 AIN10 Pin Present</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN11</name>
              <description>ADC Module 1 AIN11 Pin Present</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN12</name>
              <description>ADC Module 1 AIN12 Pin Present</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN13</name>
              <description>ADC Module 1 AIN13 Pin Present</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN14</name>
              <description>ADC Module 1 AIN14 Pin Present</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1AIN15</name>
              <description>ADC Module 1 AIN15 Pin Present</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBORCTL</name>
          <displayName>SYSCTL_PBORCTL</displayName>
          <description>Brown-Out Reset Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOR1</name>
              <description>VDD under BOR1 Event Action</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOR0</name>
              <description>VDD under BOR0 Event Action</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <displayName>SYSCTL_SRCR0</displayName>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT0</name>
              <description>WDT0 Reset Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB</name>
              <description>HIB Reset Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 Reset Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 Reset Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM0</name>
              <description>PWM Reset Control</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 Reset Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN1 Reset Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT1</name>
              <description>WDT1 Reset Control</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR1</name>
          <displayName>SYSCTL_SRCR1</displayName>
          <description>Software Reset Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART0 Reset Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Reset Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 Reset Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI0 Reset Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI1 Reset Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI0 Reset Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI1 Reset Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Reset Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 Reset Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer 0 Reset Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer 1 Reset Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer 2 Reset Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer 3 Reset Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comp 0 Reset Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comp 1 Reset Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
