m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>DCGC0</name>
          <displayName>SYSCTL_DCGC0</displayName>
          <description>Deep Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB</name>
              <description>HIB Clock Gating Control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM0</name>
              <description>PWM Clock Gating Control</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC1</name>
          <displayName>SYSCTL_DCGC1</displayName>
          <description>Deep-Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0</name>
              <description>UART0 Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC2</name>
          <displayName>SYSCTL_DCGC2</displayName>
          <description>Deep Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>USB0</name>
              <description>USB0 Clock Gating Control</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPCLKCFG</name>
          <displayName>SYSCTL_DSLPCLKCFG</displayName>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PIOSCPD</name>
              <description>PIOSC Power Down Request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>O</name>
              <description>Clock Source</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IGN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D</name>
              <description>Divider Field Override</description>
              <lsb>23</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <displayName>SYSCTL_SYSPROP</displayName>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_SYSPROP_FPU</name>
              <description>FPU Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <displayName>SYSCTL_PIOSCCAL</displayName>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UT</name>
              <description>User Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Update Trim</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL</name>
              <description>Start Calibration</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UTEN</name>
              <description>Use User Trim Value</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <displayName>SYSCTL_PIOSCSTAT</displayName>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CT</name>
              <description>Calibration Trim Value</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CR</name>
              <description>Calibration Result</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DT</name>
              <description>Default Trim Value</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ0</name>
          <displayName>SYSCTL_PLLFREQ0</displayName>
          <description>PLL Frequency 0</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MINT</name>
              <description>PLL M Integer Value</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MFRAC</name>
              <description>PLL M Fractional Value</description>
              <lsb>10</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFREQ1</name>
          <displayName>SYSCTL_PLLFREQ1</displayName>
          <description>PLL Frequency 1</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>N</name>
              <description>PLL N Value</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>Q</name>
              <description>PLL Q Value</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLSTAT</name>
          <displayName>SYSCTL_PLLSTAT</displayName>
          <description>PLL Status</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSCTL_PLLSTAT_LOCK</name>
              <description>PLL Lock</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLPPWRCFG</name>
          <displayName>SYSCTL_SLPPWRCFG</displayName>
          <description>Sleep Power Configuration</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPPWRCFG</name>
          <displayName>SYSCTL_DSLPPWRCFG</displayName>
          <description>Deep-Sleep Power Configuration</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRAMPM</name>
              <description>SRAM Power Modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBY</name>
                  <description>Standby Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHPM</name>
              <description>Flash Power Modes</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRM</name>
                  <description>Active Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLP</name>
                  <description>Low Power Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DC9</name>
          <displayName>SYSCTL_DC9</displayName>
          <description>Device Capabilities 9</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
