m-labs/dslite2svd/svd/tm4c123gh6pm.xml
        <register>
          <name>PRI27</name>
          <displayName>NVIC_PRI27</displayName>
          <description>Interrupt 108-111 Priority</description>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 108 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 109 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 110 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 111 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI28</name>
          <displayName>NVIC_PRI28</displayName>
          <description>Interrupt 112-115 Priority</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 112 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 113 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 114 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 115 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI29</name>
          <displayName>NVIC_PRI29</displayName>
          <description>Interrupt 116-119 Priority</description>
          <addressOffset>0x00000474</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 116 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 117 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 118 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 119 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI30</name>
          <displayName>NVIC_PRI30</displayName>
          <description>Interrupt 120-123 Priority</description>
          <addressOffset>0x00000478</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 120 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 121 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 122 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 123 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI31</name>
          <displayName>NVIC_PRI31</displayName>
          <description>Interrupt 124-127 Priority</description>
          <addressOffset>0x0000047C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 124 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 125 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 126 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 127 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI32</name>
          <displayName>NVIC_PRI32</displayName>
          <description>Interrupt 128-131 Priority</description>
          <addressOffset>0x00000480</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt 128 Priority Mask</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt 129 Priority Mask</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt 130 Priority Mask</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt 131 Priority Mask</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI33</name>
          <displayName>NVIC_PRI33</displayName>
          <description>Interrupt 132-135 Priority</description>
          <addressOffset>0x00000484</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt Priority for Interrupt [4n]</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt Priority for Interrupt [4n+1]</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt Priority for Interrupt [4n+2]</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt Priority for Interrupt [4n+3]</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI34</name>
          <displayName>NVIC_PRI34</displayName>
          <description>Interrupt 136-139 Priority</description>
          <addressOffset>0x00000488</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTA</name>
              <description>Interrupt Priority for Interrupt [4n]</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTB</name>
              <description>Interrupt Priority for Interrupt [4n+1]</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTC</name>
              <description>Interrupt Priority for Interrupt [4n+2]</description>
              <lsb>21</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INTD</name>
              <description>Interrupt Priority for Interrupt [4n+3]</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <displayName>NVIC_CPUID</displayName>
          <description>CPU ID Base</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REV</name>
              <description>Revision Number</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Part Number</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_PARTNO_CM4</name>
                  <description>Cortex-M4 processor</description>
                  <value>0xc24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CON</name>
              <description>Constant</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VAR</name>
              <description>Variant Number</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IMP</name>
              <description>Implementer Code</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_IMP_ARM</name>
                  <description>ARM</description>
                  <value>0x41</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CTRL</name>
          <displayName>NVIC_INT_CTRL</displayName>
          <description>Interrupt Control and State</description>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VEC_ACT</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RET_BASE</name>
              <description>Return to Base</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VEC_PEN</name>
              <description>Interrupt Pending Vector Number</description>
              <lsb>12</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD</name>
                  <description>Hard fault</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEM</name>
                  <description>Memory management fault</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS</name>
                  <description>Bus fault</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USG</name>
                  <description>Usage fault</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVC</name>
                  <description>SVCall</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNDSV</name>
                  <description>PendSV</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TICK</name>
                  <description>SysTick</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISR_PEND</name>
              <description>Interrupt Pending</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ISR_PRE</name>
              <description>Debug Interrupt Handling</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>SysTick Clear Pending</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>SysTick Set Pending</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UNPEND_SV</name>
              <description>PendSV Clear Pending</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PEND_SV</name>
              <description>PendSV Set Pending</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NMI_SET</name>
              <description>NMI Set Pending</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTABLE</name>
          <displayName>NVIC_VTABLE</displayName>
          <description>Vector Table Offset</description>
          <addressOffset>0x00000D08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NVIC_VTABLE_OFFSET</name>
              <description>Vector Table Offset</description>
              <lsb>10</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APINT</name>
          <displayName>NVIC_APINT</displayName>
          <description>Application Interrupt and Reset Control</description>
          <addressOffset>0x00000D0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VECT_RESET</name>
              <description>System Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VECT_CLR_ACT</name>
              <description>Clear Active NMI / Fault</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>System Reset Request</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIGROUP</name>
              <description>Interrupt Priority Grouping</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_7_1</name>
                  <description>Priority group 7.1 split</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6_2</name>
                  <description>Priority group 6.2 split</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_5_3</name>
                  <description>Priority group 5.3 split</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_4</name>
                  <description>Priority group 4.4 split</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_5</name>
                  <description>Priority group 3.5 split</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_6</name>
                  <description>Priority group 2.6 split</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1_7</name>
                  <description>Priority group 1.7 split</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_0_8</name>
                  <description>Priority group 0.8 split</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>Data Endianess</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTKEY</name>
              <description>Register Key</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_APINT_VECTKEY</name>
                  <description>Vector key</description>
                  <value>0x5fa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <displayName>NVIC_SYS_CTRL</displayName>
          <description>System Control</description>
          <addressOffset>0x00000D10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLEEPEXIT</name>
              <description>Sleep on ISR Exit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Deep Sleep Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>Wake Up on Pending</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_CTRL</name>
          <displayName>NVIC_CFG_CTRL</displayName>
          <description>Configuration and Control</description>
          <addressOffset>0x00000D14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BASE_THR</name>
              <description>Thread State Control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_PEND</name>
              <description>Allow Main Interrupt Trigger</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>UNALIGNED</name>
              <description>Trap on Unaligned Access</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV0</name>
              <description>Trap on Divide by 0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>Ignore Bus Fault in NMI and Fault</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>STKALIGN</name>
              <description>Stack Alignment on Exception Entry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
